Tekla Open API Reference for Tekla Structures 2025
MaterialItem.Select Method (String)
 Selects the material item based on the name from the material database. The material name can also be an alias name.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string materialName
)
Public Function Select (
	materialName As String
) As Boolean
Parameters
materialName
Type: System.String
The name or alias name of the material.
Return Value
Type: Boolean
True on success. False if the material was not found.
See Also
Reference
MaterialItem Class
Select Overload
Tekla.Structures.Catalogs Namespace